In [10]:
import psycopg2

In [184]:
def get_Redshift_connection():
    host = "grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com"
    redshift_user = "id"
    redshift_pass = "pass"
    port = 5439
    dbname = "dev"
    conn = psycopg2.connect("dbname={dbname} user={user} host={host} password={password} port={port}".format(
        dbname=dbname,
        user=redshift_user,
        password=redshift_pass,
        host=host,
        port=port
    ))
    conn.set_session(readonly=True, autocommit=True)
    return conn.cursor()

In [4]:
# 쿼리 동작 방식 1
'''cur = get_Redshift_connection()

sql = "SELECT * FROM raw_data.user_session_channel LIMIT 10;"
cur.execute(sql)
rows = cur.fetchall()

for r in rows:
  print(r)'''

'cur = get_Redshift_connection()\n\nsql = "SELECT * FROM raw_data.user_session_channel LIMIT 10;"\ncur.execute(sql)\nrows = cur.fetchall()\n\nfor r in rows:\n  print(r)'

In [12]:
import pandas.io.sql as sqlio

In [186]:
# 쿼리 동작 방식 2 (선택)
user = 'id'
password = 'pass'

conn = f'postgresql://{user}:{password}@grepp-data.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev'

# 조인 테이블 확인
'''sql = "SELECT * " \
      "FROM raw_data.session_timestamp as t natural join raw_data.user_session_channel as u " \
      ";"'''

# 날짜 형식 확인
'''sql = "SELECT TO_CHAR(ts, 'yyyy-mm:') as Month, COUNT(Month) " \
      "FROM raw_data.session_timestamp " \
      "GROUP BY Month " \
      "ORDER BY Month;"'''

# 조인 테이블에 날짜 형식 확인
'''sql = "SELECT DISTINCT u.userid, TO_CHAR(t.ts, 'yyyy-mm:') as Month " \
      "FROM raw_data.session_timestamp as t natural join raw_data.user_session_channel as u " \
      ";"'''

# 최소(min)년도, 최대(max)년도 정보 추출
year_sql = "SELECT min(TO_CHAR(ts, 'yyyy')), max(TO_CHAR(ts, 'yyyy')) " \
           "FROM raw_data.session_timestamp;" \

year = sqlio.read_sql_query(year_sql, conn)

min_year = int(year.iloc[0, 0])
max_year = int(year.iloc[0, 1])

# 각각 월별로만 userid가 중복되지않게 테이블을 구해서 UNION 연산으로 하나의 테이블을 만든다
'''ex) 2019-05의 테이블 쿼리 : 
       "SELECT DISTINCT u.userid, TO_CHAR(ts, 'yyyy-mm:') as Month " +
       "FROM raw_data.session_timestamp as t natural join raw_data.user_session_channel as u " +
       "WHERE Month LIKE '2019-05%%' "'''

# 각 월별 쿼리를 담을 리스트
union = list()

# 년도의 월별 쿼리를 리스트에 추가
for y in range(min_year, max_year+1):
    for m in range(1, 13):
        union.append("SELECT DISTINCT u.userid, TO_CHAR(ts, 'yyyy-mm:') as Month " +
                     "FROM raw_data.session_timestamp as t natural join raw_data.user_session_channel as u " +
                     f"WHERE Month LIKE '{y}-{m:02d}%%' ")
        union.append("UNION ")

# 쿼리 리스트를 한 문장의 쿼리로 합친다 (맨 마지막 UNION 제외)
union_sql = ''.join(union[:-1])

# UNION 연산으로 만든 테이블을 년-월별로 카운트하고 오름차순 정렬한다 (Month 형식 : 'YYYY-MM')
sql = f"SELECT Month, COUNT(Month) FROM ({union_sql}) GROUP BY Month ORDER BY Month;"

# 쿼리 실행
df = sqlio.read_sql_query(sql, conn)

In [187]:
# 결과 출력
df

      month  count
0  2019-05:    281
1  2019-06:    459
2  2019-07:    623
3  2019-08:    662
4  2019-09:    639
5  2019-10:    763
6  2019-11:    721